_sdaiCreateRepository(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new repository with a specified name within the current SDAI session.
\param session  [in] An SDAI session instance.
\param name     [in] A string that contains the new repository name.
\returns A pointer to the created repository if it was successfully created; otherwise, the function returns the NULL pointer.
\remarks
The functions starting from _sdai are ODA extensions over the standard.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = _sdaiCreateRepository(session, "test_repo");
sdaiOpenRepository(session, repo);
...
sdaiCloseRepository(repo);